Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: A curse is on you, scribes and Pharisees, false ones! for you are like the resting-places of the dead, which are made white, and seem beautiful on the outside, but inside are full of dead men's bones and of all unclean things.
chr: ᎤᏲᎢᏳ ᎢᏣᎵᏍᏓᏁᏗ ᏗᏦᏪᎵᏍᎩ ᎠᎴ ᎢᏥᏆᎵᏏ ᎢᏣᏠᎾᏍᏗ! ᎾᏍᎩᏯᏉᏰᏃ ᏂᎯ ᏧᏁᎬ ᎢᏗᎬᏁᎸᎯ ᏓᏤᎵᏍᏛᎢ, ᎾᏍᎩ ᎦᏚᎢᏗᏢ ᎤᏙᎯᏳᎯ ᏧᏬᏚᎯᏳ ᏥᎨᏐᎢ, ᎠᏎᏃ ᎠᏫᏂᏗᏢ ᏧᎧᎵᏨᎯ ᏥᎨᏐ ᏧᏂᏲᎱᏒᎯ ᏧᏂᎪᎳ ᎠᎴ ᏂᎦᎥ ᎦᏓᎭ ᎨᏒᎢ

source: Even so you seem to men to be full of righteousness, but inside you are all false and full of wrongdoing.
chr: ᎾᏍᎩᏯᏉᏍᎩᏂ ᎾᏍᏉ ᏂᎯ ᎦᏚᎢᏗᏢ ᎢᏣᏓᏅᏘᏳ ᏅᏩᏍᏙᎢ ᏴᏫ ᏗᎨᏣᎧᏃᏗᏱ, ᎠᏎᏃ ᎠᏫᏂᏗᏢ ᎢᏥᎧᎵᏨᎯ ᎨᏐ ᎢᏣᏠᎾᏍᏛᎢ ᎠᎴ ᎤᏲᎢ.

source: A curse is on you, scribes and Pharisees, false ones! because you put up buildings for housing the dead bodies of the prophets, and make fair the last resting-places of good men, and say,
chr: ᎤᏲᎢᏳ ᎢᏣᎵᏍᏓᏁᏗ ᏗᏦᏪᎵᏍᎩ ᎠᎴ ᎢᏥᏆᎵᏏ ᎢᏣᏠᎾᏍᏗ! ᏕᏦᏢᎯᏏᏍᎪᏰᏃ ᏕᎦᏂᏌᎲ ᎠᎾᏙᎴᎰᏍᎩ, ᎠᎴ ᏕᏦᏚᎢᏍᏗᏍᎪ ᏓᏤᎵᏍᏛ ᎤᎾᏓᏅᏘ;

source: If we had been living in the days of our fathers, we would not have taken part with them in the blood of the prophets.
chr: ᎯᎠᏃ ᏂᏥᏪᏍᎪᎢ; ᎢᏳᏃ ᎠᏴ ᏲᏤᎮ ᎾᎯᏳ ᏦᎩᏙᏓ ᏣᏁᎮᎢ, ᎥᏝ ᏱᏙᎦᏲᏣᎵᎪᏁᎴ ᎩᎬ ᏚᎾᏤᏪᎸ ᎠᎾᏙᎴᎰᏍᎩ.

source: So that you are witnesses against yourselves that you are the sons of those who put the prophets to death.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏨᏒ ᎬᏂᎨᏒ ᏂᏣᏓᏛᏁ ᎾᏍᎩ ᏗᏥᏙᏓ ᎨᏒ ᎠᎾᏙᎴᎰᏍᎩ ᏧᏂᎸᎯ.

source: Make full, then, the measure of your fathers.
chr: ᎢᏥᎧᎵᏣᎪᎦ ᏗᏥᏙᏓ ᎤᎾᏟᎶᎥᎢ.

source: You snakes, offspring of snakes, how will you be kept from the punishment of hell?
chr: ᎢᎾᏛ ᏂᎯ! ᎤᏂᏍᎦᏎᏗ ᎢᎾᏛ ᏧᏁᏥ ᏂᎯ! ᎦᏙᏃ ᏱᎦᎵᏍᏙᏓ ᏰᏣᏗᏫᏏ ᎠᎩᎵᏲᎢᏍᏗ ᏗᎨᏒ ᏨᏍᎩᏃᎢ?

source: For this reason, I send you prophets, and wise men, and scribes: some of them you will put to death and put on the cross, and to some of them you will give blows in your Synagogues, driving them from town to town;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎬᏂᏳᏉ ᏕᏥᏅᎵ ᎾᎿ ᏗᏤᎲ ᎠᎾᏙᎴᎰᏍᎩ ᎠᎴ ᎠᏂᎦᏔᎿᎢ ᎠᎴ ᏗᏃᏪᎵᏍᎩ; ᎢᎦᏛᏃ ᏙᏓᏥᎵ ᎠᎴ ᏙᏓᏣᏛᏂ ᏓᏓᎿᏩᏍᏛᎢ, ᎢᎦᏛᏃ ᏙᏓᏥᎵᎥᏂᎵ ᏗᏥᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᎤᏲ ᏂᏙᏓᏨᏁᎵ ᏕᎦᏚᎿᎥᎢ;

source: So that on you may come all the blood of the upright on the earth, from the blood of upright Abel to the blood of Zachariah, son of Barachiah, whom you put to death between the Temple and the altar.
chr: ᎾᏍᎩ ᎢᏥᎷᏤᏗᏱ ᏂᎦᏛ ᎣᏍᏛ ᎩᎬ ᎡᎶᎯ ᎤᏤᏬᏨᎯ, ᎤᏓᏅᏘ ᎡᏈᎵ ᎤᎩᎬ ᏅᏓᎬᏩᏓᎴᏅᏛ, ᏤᎦᎳᏯ ᎤᎩᎬ ᏇᎵᎦᏯ ᎤᏪᏥ ᏅᏛᏍᏗ, ᎾᏍᎩ ᏤᏥᎸ ᎤᏜᏅᏛ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᏥᎸᏃ-ᎨᎳᏍᏗᏱ.

source: Truly I say to you, All these things will come on this generation.
chr: ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᏓᏳᎾᎵᏱᎶᎮᎵ ᎯᎠ ᎪᎯ ᏣᏁᎭ.

source: O Jerusalem, Jerusalem, putting to death the prophets, and stoning those who are sent to her! Again and again would I have taken your children to myself as a bird takes her young ones under her wings, and you would not!
chr: ᏥᎷᏏᎵᎻ! ᏥᎷᏏᎵᎻ! ᎠᎾᏙᎴᎰᏍᎩ ᏘᎯᎯ, ᎠᎴ ᎨᏣᎷᏤᏗᏱ ᎨᏥᏅᏒᎯ ᏅᏯ ᏛᏂᏍᏗᏍᎩ! ᏯᏃᎩᏳ ᎠᏆᏚᎵᏍᎬ ᎦᏥᏯᏟᏐᏗᏱ ᏗᏤᏥ, ᎾᏍᎩᏯ ᏣᏔᎦ ᏥᏕᎦᏟᏏᏍᎪ ᏧᏪᏥ ᎠᏂᏛ ᏗᎧᏃᎨᏂ ᎭᏫᏂᏗᏢ; ᎠᏎᏃ ᎥᏝ ᏱᏣᏚᎵᏍᎨᎢ.

source: See, your house is made waste.
chr: ᎬᏂᏳᏉ ᎢᏣᏤᎵ ᎦᎵᏦᏕ ᏅᏔ ᏁᏨᏁᎸ.

source: For I say to you, You will not see me from this time till you say, A blessing on him who comes in the name of the Lord.
chr: ᎯᎠᏰᏃ ᏂᏨᏪᏎᎭ; ᎥᏝ ᏴᎨᏍᎩᎪᏩᏛ ᎪᎯ ᎢᏳᏓᎴᏅᏛ, ᎬᏂ ᎯᎠ ᏂᏥᏪᏒᎭ; ᎠᏥᎸᏉᏗᏳ ᎾᏍᎩ ᏱᎰᏩ ᏕᎤᏙᎥ ᏥᎦᎷᎯᏍᏗᎭ.

source: Chapter 24
chr: ᎠᏯᏙᎸᎢ 24

source: And Jesus went out of the Temple, and on the way his disciples came to him, pointing out the buildings of the Temple.
chr: ᏥᏌᏃ ᎤᏄᎪᏨᎩ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎤᏓᏅᏒᎩ, ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎬᏩᎷᏤᎸ ᎬᏩᏃᏁᎸᎩ ᏂᏚᏍᏛ ᏓᏓᏁᎸ ᎤᏛᎾᏗᎦᎳᏫᎢᏍᏗᏱ.

source: But he, answering, said to them, See you not all these things? truly I say to you that here there will not be one stone resting on another, which will not be pulled down.
chr: ᏥᏌᏃ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᏝᏍᎪ ᏂᎦᏛ ᎯᎠ ᏱᏗᏥᎪᏩᏘᎭ? ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎥᏝ ᏌᏉᎤᏅ ᏅᏯ ᎠᏂ ᏱᏚᏓᏌᏝᎮᏍᏗ ᎾᏍᎩ ᏂᎪᎲᏔᏅᎾ ᏱᎨᏎᏍᏗ.

source: And while he was seated on the Mountain of Olives, the disciples came to him privately, saying, Make clear to us, when will these things be? and what will be the sign of your coming and of the end of the world?
chr: ᎣᎵᏩᏲᏃ ᎤᏌᎯᎸ ᎤᏬᎸᎢ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎤᏅᏒ ᎨᏒ ᎬᏩᎷᏤᎸᎩ, ᎯᎠ ᏄᏂᏪᏒᎩ; ᏍᎩᏃᎲᏏ ᎯᎳᎪ ᎢᏳ ᎯᎠ ᎾᏍᎩ ᏅᏓᎦᎵᏍᏔᏂ; ᎠᎴ ᎦᏙ ᎤᏍᏗ ᎤᏰᎸᏛ ᎨᏎᏍᏗ ᏣᎷᎯᏍᏗᏱ, ᎠᎴ ᎪᎯ ᎨᏒ ᎤᎵᏍᏆᏗᏍᏗᏱ?

source: And Jesus said to them in answer, Take care that you are not tricked.
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᎢᏤᏯᏔᎮᏍᏗ ᏞᏍᏗ ᎩᎶ ᏥᏥᎶᏄᎮᎵ;

source: For people will come in my name, saying, I am the Christ; and a number will be turned from the true way through them.
chr: ᎤᏂᏣᏖᏍᏗᏰᏃ ᎠᏴ ᏓᏆᏙᎥ ᎠᏂᎷᎯᏍᏗᏍᎨᏍᏗ, ᎠᏴ ᎦᎶᏁᏛ, ᎠᎾᏗᏍᎨᏍᏗ; ᎠᎴ ᎤᏂᏣᏓᏍᏗ ᏓᏂᎶᏄᎮᏍᎨᏍᏗ.

source: And news will come to you of wars and talk of wars: do not be troubled, for these things have to be; but it is still not the end.
chr: ᎠᎴ ᎢᏣᏛᎩᏍᎨᏍᏗ ᏓᎿᏩ ᎠᎴ ᎠᏂᏃᎮᎵᏙᎲ ᏓᎿᏯ; ᎢᏤᏯᏔᎮᏍᏗ ᏞᏍᏗ ᎤᏪᎵᎯᏍᏗ ᏱᏂᏣᎵᏍᏓᏁᎴᏍᏗ; ᎾᏍᎩᏰᏃ ᏂᎦᏗᏳ ᎠᏎ ᎢᏳᎵᏍᏙᏗ, ᎠᏎᏃ ᎤᎵᏍᏆᏗᏍᏗᏱ ᎨᏒ ᎠᏏ ᎨᏎᏍᏗ.

source: For nation will be moved against nation, and kingdom against kingdom, and men will be without food, and the earth will be shaking in different places;
chr: ᏧᎾᏓᎴᏅᏛᏰᏃ ᏴᏫ ᏙᏛᎾᎴᏂ ᏙᏛᎾᏓᏡᏔᏂ, ᎠᎴ ᎠᏰᎵ ᏚᏃᏢᏩᏗᏒ ᏙᏛᎾᏓᏡᏔᏂ, ᎠᎴ ᏓᎪᏄᎶᏏᏙᎮᏍᏗ, ᎠᎴ ᎥᏳᎩᎯᏳ ᏂᎦᎵᏍᏔᏂᏙᎮᏍᏗ, ᎠᎴ ᎦᏙᎯ ᏓᎵᏖᎸᏂᏙᎮᏍᏗ.

source: But all these things are the first of the troubles.
chr: ᎾᏍᎩ ᎯᎠ ᏂᎦᏛ ᎠᎴᏂᏍᎬ ᎨᏒ ᎠᎩᎵᏯ ᎨᏒᎢ.

source: Then they will be cruel to you, and will put you to death: and you will be hated by all nations because of my name.
chr: ᎿᏉᏃ ᏂᎯ ᏫᏙᏓᎨᏥᏲᏏ ᎢᏥᎩᎵᏲᎢᏍᏗᏱ, ᎠᎴ ᏙᏓᎨᏥᎵ; ᎠᎴ ᏂᎦᏗᏳ ᏄᎾᏓᎴᏒ ᏴᏫ ᎨᏥᏍᎦᎨᏍᏗ ᎠᏴ ᏓᏆᏙᎥ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ.

source: And numbers of people will be turned from the right way, and will give one another up and have hate for one another.
chr: ᎿᏉᏃ ᎤᏂᏣᏖᏍᏗ ᏚᏃᏕᎯᎮᏍᏗ, ᎠᎴ ᏓᎾᏓᏡᏗᏍᎨᏍᏗ ᎠᎴ ᏓᎾᏓᏍᎦᎨᏍᏗ.

source: And a number of false prophets will come, causing error.
chr: ᎠᎴ ᎤᏂᏣᏖᏍᏗ ᎤᎾᏠᎾᏍᏗ ᎠᎾᏙᎴᎰᏍᎩ ᎠᏂᎾᏄᎪᎨᏍᏗ, ᎠᎴ ᎤᏂᏣᏖᏍᏗ ᏓᏂᎶᏄᎮᏍᎨᏍᏗ.

source: And because wrongdoing will be increased, the love of most people will become cold.
chr: ᎠᎴ ᎤᏣᏛ ᎠᏍᎦᏅᎢᏍᏗ ᎨᏒ ᎡᎲ ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏂᏣᏖᏍᏗ ᎠᏓᎨᏳᏗ ᎨᏒ ᎤᏁᎲ ᏛᏴᏜᏗ.

source: But he who goes through to the end will get salvation.
chr: ᎠᏎᏃ ᎾᏍᎩ Ꮎ ᎬᎵᏍᏆᏗᏍᎩ ᎠᏟᏂᎬᏁᎯ ᎾᏍᎩ ᎠᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ.

source: And this good news of the kingdom will be given through all the world for a witness to all nations; and then the end will come.
chr: ᎯᎠᏃ ᎾᏍᎩ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᎸᎳᏗ ᎤᏤᎵᎪᎯ ᎡᎳᏂᎬ ᎤᎾᎵᏥᏙᏂᏂᏓᏍᏗ ᎨᏎᏍᏗ ᎤᎾᏙᎴᎰᎯᏍᏗᏱ ᎾᏂᎥ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎩᎳᏃ ᎿᏉ ᏛᎵᏍᏆᏗᎵ.

source: When, then, you see in the holy place the unclean thing which makes destruction, of which word was given by Daniel the prophet (let this be clear to the reader),
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎿᏉ ᎢᏥᎪᎲᎭ ᎤᏍᎦᎢᏍᏗᏳ ᎬᏃᏌᏛᎯ ᎢᎬᏁᎯ, ᎾᏍᎩ ᏕᏂᎵ ᎠᏙᎴᎰᏍᎩ ᏧᏁᎢᏍᏔᏁᎢ, ᎦᏙᎨᏍᏗ ᎦᎸᏉᏗᏳ ᎨᏒᎢ, (ᎩᎶ ᎠᎪᎵᏰᏍᎨᏍᏗ ᎪᎵᎨᏍᏗ,)

source: Then let those who are in Judaea go in flight to the mountains:
chr: ᎿᏉ ᏧᏗᏱ ᎠᏂᏂ ᎠᎾᎵᏒᎭ ᏙᏦᏓᎸ ᏩᏂᎶᏒᎭ.

source: Let not him who is on the house-top go down to take anything out of his house:
chr: ᎩᎶᏃ ᎦᏌᎾᎵ ᎤᎩᎴᏍᏗ ᏞᏍᏗ ᏴᏗᎤᏠᎠᏎᏍᏗ ᏳᎩᏐᎴᏍᏗ ᎪᎱᏍᏗ ᎤᎲ ᎦᏁᎸᎢ;

source: And let not him who is in the field go back to get his coat.
chr: ᎠᎴ ᎩᎶ ᏠᎨᏏ ᏪᏙᎯ ᏞᏍᏗ ᏴᏗᎤᏨᏎᏍᏗ ᏧᏄᏬ ᏱᏚᏁᏐᎴᏍᏗ.

source: But it will be hard for women who are with child and for those with babies at the breast in those days.
chr: ᎠᎴ ᎤᏲᎢᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᏗᏂᏁᎵᏛ ᎠᎴ ᏧᏂᏍᏓᎢ ᎾᎯᏳ ᎨᏒᎢ.

source: And say a prayer that your flight may not be in the winter, or on a Sabbath.
chr: ᎠᎴ ᎢᏣᏓᏙᎵᏍᏗᏍᎨᏍᏗ ᎢᏥᏔᏲᎯᎮᏍᏗ ᎪᎳ ᎠᎴ ᎤᎾᏙᏓᏆᏍᎬ ᎢᏣᎵᏍᏗᏱ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ.

source: Because in those days there will be great sorrow, such as there has not been from the start of the world till now, or ever will be.
chr: ᎾᎯᏳᏰᏃ ᎤᏣᏖᏍᏗ ᎠᎩᎵᏯ, ᎾᏍᎩ ᎢᎦᎢ ᎥᏝ ᎢᎸᎯᏳ ᏱᏄᎵᏍᏔᏃ ᎡᎶᎯ ᏧᏙᏢᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ ᎪᎯ ᎢᏯᏍᏘ, ᎥᏝ ᎠᎴ ᎢᎸᎯᏳ ᎾᏍᎩ ᎢᏳᎵᏍᏙᏗ ᏱᎨᏎᏍᏗ.

source: And if those days had not been made short there would have been no salvation for any, but because of the saints those days will be made short.
chr: ᎠᎴ ᎾᎯᏳ ᎢᎦ ᏂᏓᏍᏆᎳᏅᎾ ᏱᎩ, ᎥᏝ ᎤᏇᏓᎵ ᎦᏰᏥᏍᏕᎸᏗ ᏱᎦᎩ; ᎠᏎᏃ ᎨᎦᏑᏰᏛ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ ᎾᎯᏳ ᎢᎦ ᏗᏍᏆᎶᏗ ᎨᏎᏍᏗ

source: Then if any man says to you, See, here is the Christ, or, Here; do not put faith in him;
chr: ᎾᎯᏳ ᎨᏒ ᎢᏳᏃ ᎩᎶ ᎯᎠ ᏂᏥᏪᏎᎮᏍᏗ, ᎬᏂᏳᏉ ᎠᏂ ᎦᎶᏁᏛ ᎡᏙᎭ; ᎠᎴ ᎠᏂ; ᏞᏍᏗ ᏥᏦᎯᏳᏂ

source: For there will come up false Christs, and false prophets, who will do great signs and wonders; so that if possible even the saints might be tricked.
chr: ᏛᏂᎾᏄᎪᏥᏰᏃ ᎤᎾᏠᎾᏍᏗ ᎦᎶᏁᏛ ᎠᎴ ᎤᎾᏠᎾᏍᏗ ᎠᎾᏙᎴᎰᏍᎩ, ᎠᎴ ᎠᏂᎾᏄᎪᏫᏍᎨᏍᏗ ᎦᎸᏉᏗᏳ ᎤᏰᎸᏛ ᎠᎴ ᎤᏍᏆᏂᎪᏗ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏳᏃ ᏰᎵ ᎢᎬᏩᎵᏍᏙᏗ ᏱᎩ ᏱᏓᏂᎶᏄᎲᎵ ᎾᏍᏉ ᎨᎦᏑᏰᏛ.

source: See, I have made it clear to you before it comes about.
chr: ᎬᏂᏳᏉ ᏂᏨᏃᏁᎸ.

source: If, then, they say to you, See, he is in the waste land; go not out: See, he is in the inner rooms; put no faith in it.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏳᏃ ᎯᎠ ᏂᎨᏥᏪᏎᎸᎭ; ᎢᎾᎨ ᎡᏙᎭ; ᏞᏍᏗ ᎾᎿ ᏫᏥᎶᏒᎩ; ᎬᏂᏳᏉ ᎤᏕᎵᏒ ᎧᏅᏑᎸ ᎠᏯᎠ; ᏞᏍᏗ ᏥᏦᎯᏳᏂ.

source: Because as in a thunderstorm the bright light coming from the east is seen even in the west; so will be the coming of the Son of man.
chr: ᎠᎾᎦᎵᏍᎩᏰᏃ ᏗᎧᎸᎬ ᏨᏗᎦᎾᏄᎪᎪᎢ, ᏭᏕᎵᎬᏃ ᎢᏴᏛ ᏥᏫᏗᎦᎸᏌᏓᏗᏍᎪᎢ, ᎾᏍᎩᏯ ᎾᏍᏉ ᏄᏍᏕᏍᏗ ᏴᏫ ᎤᏪᏥ ᎦᎷᏥᎸᎭ.

source: Wherever the dead body is, there will the eagles come together.
chr: ᎢᎸᎯᏢᏰᏃ ᎪᎱᏍᏗ ᎤᎵᏬᏨᎯ ᏥᎦᏃᎢ, ᎾᎿ ᎠᏬᎭᎵ ᎠᎾᏓᏟᏏᏍᎪᎢ.

source: But straight away, after the trouble of those days, the sun will be made dark and the moon will not give her light and the stars will come down from heaven and the powers of heaven will be moved:
chr: ᎢᎬᏪᏅᏓᏉ ᎣᏂ ᎾᏍᎩ ᎾᎯᏳ ᎠᎩᎵᏯ ᎦᎶᏐᏅᎭ, ᏅᏙ ᎢᎦ ᎡᎯ ᏛᎵᏏᎲᏏ, ᎠᎴ ᏅᏙ ᏒᏃᏱ ᎡᎯ ᎥᏝ ᎢᎦ ᏳᏘᏍᏕᏍᏗ, ᎠᎴ ᏃᏈᏏ ᏛᏂᏅᎪᎠᏏ, ᎠᎴ ᎤᏂᏣᏘ ᎦᎸᎶᎢ ᏣᏂᎧᎳ ᏛᎾᎵᏖᎸᏂ.

source: And then the sign of the Son of man will be seen in heaven: and then all the nations of the earth will have sorrow, and they will see the Son of man coming on the clouds of heaven with power and great glory.
chr: ᎿᏉᏃ ᎦᎸᎶᎢ ᏓᎦᎾᏄᎪᏥ ᏴᏫ ᎤᏪᏥ ᎤᏤᎵ ᎤᏰᎸᏛᎢ, ᎠᎴ ᎿᏉ ᏂᎦᏛ ᏓᏂᎳᏍᏓᎸ ᎡᎶᎯ ᏙᏛᏂᏴᎳᏏ, ᎠᎴ ᏛᏂᎪᎯ ᏴᏫ ᎤᏪᏥ ᏣᎢᏎᏍᏗ ᎤᎶᎩᎸ ᎦᎸᎶᎢ, ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᎠᎴ ᎤᏣᏘ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏄᏬᏍᏕᏍᏗ.

source: And he will send out his angels with a great sound of a horn, and they will get his saints together from the four winds, from one end of heaven to the other.
chr: ᎿᏉᏃ ᏙᏓᎦᏅᏏ ᏧᏅᏏᏓᏍᏗ, ᎠᎴ ᎠᏍᏓᏱᏳ ᏛᏂᏤᎷᎯᏏ, ᎠᎴ ᏙᏛᏂᏟᏌᏂ ᎨᎦᏑᏰᏛ ᏅᎩ ᏂᏙᏗᎦᎶᏍᎬ ᎤᏃᎴ, ᎦᎸᎶ ᎢᏴᏛ ᏫᏚᎵᏍᏘᏂᎸ.

source: Now take an example from the fig-tree: when her branch has become soft and puts out its leaves, you are certain that the summer is near;
chr: Ꭷ, ᎢᏣᏕᎶᏆ ᏓᏟᎶᏍᏛ ᏒᎦᏔᎢᏳᏍᏗ ᏡᎬᎢ; ᎢᏳᏰᏃ ᏚᏩᏂᎦᎸ ᏗᏓᎨ ᏂᏕᎦᎵᏍᏓ, ᎠᎴ ᎩᎳᎢ ᏥᎦᎳᏍᏚᎲᏍᎪᎢ, ᎢᏥᎦᏔᎰ ᎪᎩ ᎾᎥᏂᏳ ᎨᏒᎢ.

source: Even so, when you see all these things, you may be certain that he is near, even at the doors.
chr: ᎾᏍᎩᏯᏍᎩᏂ ᎾᏍᏉ ᏂᎯ, ᎢᏳᏃ ᎿᏉ ᎯᎠ ᎾᏍᎩ ᏧᏓᎴᏅᏛ ᎢᏥᎪᎲᎭ, ᎢᏥᎦᏔᎮᏍᏗ ᎡᏍᎦᏂᏳ ᎨᏒᎢ, ᎦᎶᎯᏍᏗᏱᏉ ᎨᏒᎢ.

source: Truly I say to you, This generation will not come to an end till all these things are complete.
chr: ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ; ᎯᎠ ᎪᎯ ᏣᏁᎭ ᎥᏝ ᏴᏛᏂᎶᏐᏂ, ᎬᏂ ᏂᎦᏛ ᎯᎠ ᏧᏓᎴᏅᏛ ᏂᎦᎵᏍᏔᏅᎭ.

source: Heaven and earth will come to an end, but my words will not come to an end.
chr: ᎦᎸᎶ ᎠᎴ ᎡᎶᎯ ᏙᏓᎦᎶᏐᏂ, ᎠᏴᏍᎩᏂ ᎠᎩᏁᏨᎢ ᎥᏝ ᏴᏓᎦᎶᏐᏂ.

source: But of that day and hour no one has knowledge, not even the angels in heaven, or the Son, but the Father only.
chr: ᎠᏎᏃ ᎾᎯᏳ ᎢᎦ ᎨᏒ ᎠᎴ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒ ᎥᏝ ᎩᎶ ᏯᎦᏔᎭ, Ꮭ ᎾᏍᏉ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎦᎸᎳᏗ ᎠᏁᎯ, ᎡᏙᏓᏍᎩᏂ ᎤᏩᏒᎯᏳ.

source: And as were the days of Noah, so will be the coming of the Son of man.
chr: ᎾᏍᎩᏰᏃ ᏥᏄᏍᏕ ᎾᎯᏳ ᏃᏯ ᏤᎮᎢ, ᎾᏍᎩᏯ ᏄᏍᏕᏍᏗ ᏴᏫ ᎤᏪᏥ ᎦᎷᏨᎭ.

source: Because as in those days before the overflowing of the waters, they were feasting and taking wives and getting married, till the day when Noah went into the ark,
chr: ᎾᎯᏳᎡᏃ ᎠᏏ ᏂᎦᏃᎱᎩᏍᎬᎾ ᏥᎨᏎᎢ, ᏓᎾᎵᏍᏓᏴᎲᏍᎨᎢ, ᎠᎴ ᏓᎾᏗᏔᏍᎨᎢ, ᎠᎴ ᏓᎾᏕᏒᎲᏍᎨᎢ ᎠᎴ ᏕᎨᏥᏰᎨᎢ, ᎬᏂ ᎾᎯᏳ ᎢᎦ ᏃᏯ ᎤᏣᏅ ᏥᏳᎯ,

source: And they had no care till the waters came and took them all away; so will be the coming of the Son of man.
chr: ᎠᎴ ᎾᏁᎵᏍᎬᎾ ᏥᎨᏎᎢ, ᎬᏂ ᎤᏃᎱᎦᏂᎸ, ᎠᎴ ᏂᎦᏛ ᏚᏂᎬᏨ, ᎾᏍᎩᏯᏉᏍᎩᏂ ᎾᏍᏉ ᏄᏍᏕᏍᏗ ᏴᏫ ᎤᏪᏥ ᎦᎷᏨᎭ.

source: Then two men will be in the field; one is taken, and one let go;
chr: ᎿᏉᏃ ᎠᏂᏔᎵ ᏠᎨᏏ ᎠᏁᏙᎮᏍᏗ, ᎠᏏᏴᏫ ᎠᏥᏯᏅᏗ ᎨᏎᏍᏗ ᏐᎢᏃ ᎠᏥᎧᎯᏯᏍᏗ ᎨᏎᏍᏗ;

source: Two women will be crushing grain; one is taken, and one let go.
chr: ᎠᏂᏔᎵ ᎠᏂᎨᏴ ᎠᏂᏍᏙᏍᎨᏍᏗ ᎠᏍᏙᏍᎩᏱ, ᎠᏏᏴᏫ ᎠᏥᏯᏅᏗ ᎨᏎᏍᏗ ᏐᎢᏃ ᎠᏥᎧᎯᏯᏍᏗ ᎨᏎᏍᏗ.

source: Be watching, then! for you have no knowledge on what day your Lord will come.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏥᏯᏫᏍᎨᏍᏗ, ᎥᏝᏰᏃ ᏱᏥᎦᏔᎭ ᎢᏳᏉ ᎤᎷᎯᏍᏗᏱ ᎢᏣᏤᎵ ᎤᎬᏫᏳᎯ.

source: But be certain of this, that if the master of the house had had knowledge of the time when the thief was coming, he would have been watching, and would not have let his house be broken into.
chr: ᎯᎠᏃ ᎢᏣᏅᏖᏍᏗ, ᎢᏳᏃ ᎠᏍᎦᏯ ᎦᏁᎳ ᏱᎠᎦᏔᎮ ᎢᏳᏉ ᎦᏃᏍᎩᏍᎩ ᎤᎷᎯᏍᏗᏱ, ᏳᏯᏫᏎᎢ, ᎠᎴ ᎥᏝ ᎤᏁᎳᎩ ᏩᎩᏴᏏ ᎦᎵᏦᏕ ᏱᎬᏪᎵᏎᎢ.

source: Be ready then; for at a time which you have no thought of the Son of man will come.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏂᎯ ᎾᏍᏉ ᎢᏣᏛᏅᎢᏍᏕᏍᏗ, ᏂᏤᎵᏍᎬᎾᏉᏰᏃ ᎨᏒ ᎢᏳ ᏴᏫ ᎤᏪᏥ ᏓᎦᎷᏥ.

source: Who is the true and wise servant, whom his lord has put over those in his house, to give them their food at the right time?
chr: ᎦᎪᎨᏃ ᎠᎦᎵᏯ ᎠᎴ ᎠᏏᎾᏌᏂ ᎠᏥᏅᏏᏓᏍᏗ, ᎾᏍᎩ ᎤᏅᏏᏙᎯ ᏄᎬᏫᏳᏒ ᎢᏳᏩᏁᎸᎯ ᎦᏁᎸ ᏚᏓᏘᎿᎥᎢ, ᎾᏍᎩ ᎤᎾᎵᏍᏓᏴᏗ ᏧᏁᏗᏱ ᎤᎾᎵᏍᏓᏴᏗᏱ ᏂᎦᎵᏍᏔᏂᏒᎢ?

source: A blessing on that servant, who will be doing so when his lord comes.
chr: ᎣᏏᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎾᏍᎩ Ꮎ ᎠᏥᏅᏏᏓᏍᏗ ᎤᏅᏏᏙᎯ ᎦᎷᏨᎭ ᎤᏩᏛᎲᎭ ᎾᏍᎩ ᎾᏛᏁᎲᎢ.

source: Truly, I say to you, he will put him over all he has.
chr: ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ; ᏂᎦᏛ ᎤᎿᎥᎢ ᏛᎦᏘᏗᏍᏔᏂ.

source: But if that evil servant says in his heart, My lord is a long time in coming;
chr: ᎢᏳᏍᎩᏂᏃ ᎾᏍᎩ Ꮎ ᎤᏁᎫᏥᏛ ᎠᏥᏅᏏᏓᏍᏗ ᎯᎠ ᏂᎦᏪᏍᎨᏍᏗ ᏧᏓᏅᏛᎢ; ᎠᎩᏅᏏᏙᎯ ᎪᎯᏗᎭ ᎤᎷᎯᏍᏗᏱ;

source: And is cruel to the other servants, taking his pleasure with those who are overcome with wine;
chr: ᎠᎴ ᎠᎴᏂᏍᎨᏍᏗ ᏙᎦᎸᏂᎮᏍᏗ ᎢᏧᎳᎭ ᎨᏥᏅᏏᏓᏍᏗ, ᎠᎴ ᎢᏧᎳᎭ ᎠᎾᎵᏍᏓᏴᎲᏍᎨᏍᏗ ᎠᎴ ᏓᎾᏗᏔᏍᎨᏍᏗ ᏧᏂᏴᏍᏕᏍᎩ,

source: The lord of that servant will come in a day when he is not looking for him, and in an hour of which he has no knowledge,
chr: ᎾᏍᎩ ᎠᏥᏅᏏᏓᏍᏗ ᎤᏅᏏᏙᎯ ᏓᎦᎷᏥ ᎾᎯᏳ ᎢᎦ ᎾᏓᎦᏖᏃᎲᎾ ᎨᏒᎢ, ᎠᎴ ᎢᏳ ᏁᎵᏍᎬᎾ ᎨᏒᎢ,

source: And will have him cut in two, and will give him a part in the fate of the false ones: there will be weeping and cries of sorrow.
chr: ᎠᎴ ᏙᏓᏳᎦᎵᏏ, ᎠᎴ ᎤᎾᏠᎾᏍᏗ ᏩᏁᎲ ᏮᏓᏳᏎᎮᎵ; ᎾᎿ ᏓᏂᏴᎨᏍᏗ ᎠᎴ ᏓᏂᎸᏓᎩᏍᎨᏍᏗ ᏓᏂᏄᏙᎬᎢ.

source: Chapter 25
chr: ᎠᏯᏙᎸᎢ 25

source: Then the kingdom of heaven will be like ten virgins, the friends of the bride, who took their lights, and went out with the purpose of meeting the husband.
chr: ᎿᏉᏃ ᎦᎸᎳᏗ ᎡᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᎾᏍᎩᏯ ᎨᏎᏍᏗ ᎠᏍᎪᎯ ᎢᏯᏂᏛ ᎠᎾᏛ, ᎾᏍᎩ ᏥᏚᏂᏅᏎ ᏗᏨᏍᏙᏗ ᎠᎴ ᏥᏚᎾᏠᏒᏎ ᎠᏕᏒᎲᏍᎩ.

source: And five of them were foolish, and five were wise.
chr: ᎯᏍᎩᏃ ᎢᏯᏂᏛ ᎠᏂᎦᏔᎿᎢ ᎨᏎᎢ, ᎯᏍᎩᏃ ᎤᏂᏁᎫ.

source: For the foolish, when they took their lights, took no oil with them.
chr: ᎤᏂᏁᎫ ᏚᏂᏅᏎ ᏗᏨᏍᏙᏗ ᎠᏎᏃ ᎪᎢ ᏄᏂᏁᏨᏒᎾ ᎨᏎᎢ,

source: But the wise took oil in their vessels with their lights.
chr: ᎠᏂᎦᏔᎿᎢᏍᎩᏂ ᏚᏂᏅᏎ ᏧᏂᏨᏍᏙᏗ, ᎠᎴ ᎾᏍᏉ ᎪᎢ ᎤᏂᏁᏨᏎ ᏚᏂᏟᏍᏔᏁ ᏗᏖᎵᏙ.

source: Now the husband was a long time in coming, and they all went to sleep.
chr: ᎠᏏᏃ ᎤᎪᏂᏲᎨ ᎠᏕᏒᎲᏍᎩ, ᏂᎦᏛ ᎠᏂᎵᏅᎨᎢ, ᎠᎴ ᎤᏂᎵᏅᏤᎢ.

source: But in the middle of the night there is a cry, The husband comes! Go out to him.
chr: ᏒᏃᏱᏃ ᎠᏰᎵ ᎩᎶ ᎠᏍᏓᏯ ᎤᏁᏤᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᎬᏂᏳᏉ ᎠᏕᏒᎲᏍᎩ ᏓᏯᎢ! ᏫᏕᏣᏠᎢ!

source: Then all those virgins got up, and made ready their lights.
chr: ᎿᏉᏃ ᏂᎦᏛ ᎠᎾᏛ ᎤᎾᏗᏓᏁᏎᎢ, ᎠᎴ ᏚᏂᏥᏃᏍᎦᎸᎮ ᏚᏂᏨᏍᏛᎢ.

source: And the foolish said to the wise, Give us of your oil; for our lights are going out.
chr: ᎤᏂᏁᎫᏃ ᎯᎠ ᏂᏚᏂᏪᏎᎴ ᎠᏂᎦᏔᎿᎢ; ᎢᎦᏛ ᎪᎢ ᎢᏣᏤᎵ ᏍᎩᏁᎥᏏ, ᏙᎬᏠᎯᏎᎭᏰᏃ ᏙᎩᏨᏍᏛᎢ.

source: But the wise made answer, saying, There may not be enough for us and you; it would be better for you to go to the traders and get oil for yourselves.
chr: ᎠᏎᏃ ᎠᏂᎦᏔᎿᎢ ᎤᏂᏁᏨ ᎯᎠ ᏄᏂᏪᏎᎢ; ᏝᎨ ᏰᎵ ᏱᏙᎨᎩᏰᎵᎦ ᏂᎦᏛ, ᎢᏤᎾᏉᏍᎩᏂ ᏗᏂᏃᏗᏍᎬ, ᎢᏨᏒ ᏫᏥᏩᎯ.

source: And while they went to get oil, the master came; and those who were ready went in with him to the feast: and the door was shut.
chr: ᎤᏂᏩᏎᏅᏃ ᎠᏕᏒᎲᏍᎩ ᎤᎷᏤᎢ, ᎤᎾᏛᏅᎢᏍᏗᏃ ᎾᏍᎩ ᎢᏧᎳᎭ ᏣᎦᏨᏍᏙᏗᏱ ᏭᏂᏴᎴᎢ, ᎠᎴ ᎤᏂᏍᏚᏁ ᎦᎶᎯᏍᏗᏱ.

source: After that the other virgins came, saying, Lord, Lord, let us in.
chr: ᎣᏂᏃ ᎾᏍᏉ ᎠᏂᏐᎢ ᎠᎾᏛ ᎤᏂᎷᏤᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ; ᏣᎬᏫᏳᎯ, ᏣᎬᏫᏳᎯ, ᎡᏍᎩᏍᏚᎩ.

source: But he made answer and said, Truly I say to you, I have no knowledge of you.
chr: ᎠᏎᏃ ᏧᏁᏨ ᎯᎠ ᏄᏪᏎᎢ; ᎤᏙᎯᏳᎯᏯ ᎢᏨᏲᏎᎭ, ᎥᏝ ᏱᏨᎦᏔᎭ.

source: Keep watch, then, because you are not certain of the day or of the hour.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏥᏯᏫᏍᎨᏍᏗ, ᎥᏝᏰᏃ ᏱᏥᎦᏔᎭ ᎾᎯᏳ ᎢᎦ ᎨᏒ ᎠᎴ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒ ᎤᎷᎯᏍᏗᏱ ᏴᏫ ᎤᏪᏥ.

source: For it is as when a man, about to take a journey, got his servants together, and gave them his property.
chr: ᎾᏍᎩᏯᏉᏰᏃ ᎩᎶ ᎠᏍᎦᏯ ᎢᏅᏥᏮᏗᎦᎶᏏᏎᎢ, ᎠᎴ ᏥᏫᏚᏯᏅᎮ ᏧᏅᏏᏓᏍᏗ, ᎠᎴ ᏥᏚᏲᎯᏎᎴ ᎤᎿᎥᎢ.

source: And to one he gave five talents, to another two, to another one; to everyone as he was able; and he went on his journey.
chr: ᎠᏏᏴᏫᏃ ᎯᏍᎩ ᎢᏯᎦᏴᎵ ᎠᏕᎸ ᏚᏁᎴᎢ, ᏐᎢᏃ ᏔᎵ ᎢᏯᎦᏴᎵ, ᏐᎢᏃ ᏌᏉ ᎢᏯᎦᏴᎵ, ᎠᏂᏏᏴᏫᎭ ᎾᏍᎩ ᏰᎵ ᎢᎬᏩᎾᏛᏁᏗ ᎨᏒᎢ. ᎿᏉᏃ ᎤᏂᎩᏎᎢ.

source: Straight away he who had been given the five talents went and did trade with them, and made five more.
chr: ᎿᏉᏃ ᎯᏍᎩ ᎢᏯᎦᏴᎵ ᏣᏥᏁᎸᎯ ᎤᏪᏅᏎ ᏭᏃᏔᏁᎢ, ᎯᏍᎩᏃ ᎢᏯᎦᏴᎵ ᎤᏁᏉᏤᎴᎢ.

source: In the same way he who had been given the two got two more.
chr: ᎾᏍᏉ ᎠᎴ Ꮎ ᏔᎵ ᎢᏯᎦᏴᎵ ᏣᏥᏁᎸᎯ ᎾᏍᏉ ᏔᎵ ᎢᏯᎦᏴᎵ ᎤᏁᏉᏤᎴᎢ.

source: But he who was given the one went away and put it in a hole in the earth, and kept his lord's money in a secret place.
chr: ᏌᏉᏍᎩᏂ ᎢᏯᎦᏴᎵ ᏣᏥᏁᎸᎯ ᎤᏪᏅᏎᎢ, ᏭᏍᎪᎭ ᎦᏙᎯ, ᎠᎴ ᏫᏚᏩᏍᎦᎳᏁ ᎤᎾᏝᎢ ᏧᏤᎵ ᎠᏕᎸ.

source: Now after a long time the lord of those servants comes, and makes up his account with them.
chr: ᎢᎸᎯᏳᏃ ᎢᏴᏛ ᎤᎷᏤ ᎾᏍᎩ ᎨᏥᏅᏏᏓᏍᏗ ᎤᏂᎾᏝᎢ, ᎣᏍᏛᏃ ᏄᏅᏁᎴᎢ.

source: And he who had the five talents came with his other five talents, saying, Lord, you gave into my care five talents: see, I have got five more.
chr: ᎯᏍᎩᏃ ᎢᏯᎦᏴᎵ ᏣᏥᏁᎸᎯ ᎤᎷᏤᎢ, ᎠᎴ ᏚᏲᎴ ᏅᏩᎾᏓᎴ ᎯᏍᎩ ᎢᏯᎦᏴᎵ ᎠᏕᎸ, ᎯᎠ ᏄᏪᏎᎢ; ᏍᎩᎾᏝᎢ, ᎯᏍᎩ ᎢᏯᎦᏴᎵ ᎠᏕᎸ ᏕᏍᎩᏲᎯᏎᎸᎩ; ᎬᏂᏳᏉ ᏅᏩᎾᏓᎴ ᎯᏍᎩ ᎢᏯᏕᏴᎵ ᎬᎩᏁᏉᏤᎸ.

source: His lord said to him, Well done, good and true servant: you have been true in a small thing, I will give you control over great things: take your part in the joy of your lord.
chr: ᎤᎾᏝᎢᏃ ᎯᎠ ᏄᏪᏎᎴᎢ; ᎣᏏᏳ! ᎰᏍᏛ ᎠᎴ ᎯᎦᎵᏯ ᎡᏣᏅᏏᏓᏍᏗ! ᏚᏳᎪᏛ ᏂᏣᏛᏁᎸ ᎤᏍᏗ ᏧᏓᎴᏅᏛ ᏕᏣᎸᏫᏍᏓᏁᎸᎢ; ᎤᏣᏘ ᏧᏓᎴᏅᏛ ᏣᎬᏫᏳᏌᏕᎩ ᏅᏓᎬᏴᏁᎵ; ᎯᏴᎭ ᎣᏍᏛ ᎠᏓᏅᏓᏗᏍᏗᏱ ᏣᎾᏝᎢ ᎤᏤᎵᎪᎯ.

source: And he who had the two talents came and said, Lord, you gave into my care two talents: see, I have got two more.
chr: ᎾᏍᏉᏃ ᏔᎵ ᎢᏯᎦᏴᎵ ᏣᏥᏁᎸᎯ ᎤᎷᏨ ᎯᎠ ᏄᏪᏎᎢ; ᏍᎩᎾᏝᎢ, ᏔᎵ ᎢᏯᎦᏴᎵ ᎠᏕᎸ ᏕᏍᎩᏲᎯᏎᎸᎩ; ᎬᏂᏳᏉ ᏅᏩᎾᏓᎴ ᏔᎵ ᎢᏯᎦᏴᎵ ᎬᎩᏁᏉᏤᎸ.

source: And he who had had the one talent came and said, Lord, I had knowledge that you are a hard man, getting in grain where you have not put seed, and making profits for which you have done no work:
chr: ᎿᏉᏃ ᏌᏉ ᎢᏯᎦᏴᎵ ᏣᏥᏁᎸᎯ ᎤᎷᏨ ᎯᎠ ᏄᏪᏎᎢ; ᏍᎩᎾᏝᎢ, ᎬᎦᏔᎲᎩ, ᎯᏍᏓᏱᏳ ᎨᏒᎢ, ᎠᎴ ᎯᏍᎫᏕᏍᎬᎢ ᎾᎿ ᏂᏣᏫᏒᎾ ᎨᏒᎢ, ᎠᎴ ᎱᏖᏍᎬᎢ ᎾᎿ ᏂᏣᎴᎳᏛᏅᎾ ᎨᏒᎢ.

source: And I was in fear, and went away, and put your talent in the earth: here is what is yours.
chr: ᎠᎴ ᏥᏍᎦᎢᎲᎢ ᎠᏇᏅᏒᎩ, ᏫᏓᎬᏍᎦᎳᏅᎩ ᎦᏙᎯ ᎠᏕᎸ ᏗᏣᏤᎵᎦ; ᎬᏂᏳᏉ ᎠᏂ ᎾᏍᎩ ᏗᏣᏤᎵᎦ.

source: But his lord in answer said to him, You are a bad and unready servant; if you had knowledge that I get in grain where I did not put seed, and make profits for which I have done no work,
chr: ᎤᎾᏝᎢᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎴᎢ; ᏣᏁᎫᏥᏛ ᎠᎴ ᏣᏓᏄᎸᏗ ᎡᏣᏅᏏᏓᏍᏗ! ᎯᎦᏔᎲᎩ ᏥᏍᎫᏕᏍᎬ ᎾᎿ ᎾᎩᏫᏒᎾ ᎨᏒᎢ, ᎠᎴ ᎫᏖᏍᎬ ᎾᎿ ᎾᎩᎴᎳᏛᏅᎾ ᎨᏒᎢ!

source: Why, then, did you not put my money in the bank, and at my coming I would have got back what is mine with interest?
chr: ᎠᏕᎸ ᏗᏂᏍᏆᏂᎪᏗᏍᎩᏱ ᏱᏫᏙᏣᏁ ᎠᏕᎸ ᏗᏆᏤᎵᎦ, ᎾᏍᎩᏃ ᎪᎯ ᏥᏥᎷᎩ ᏱᏓᎩᎪᎮ ᏗᏆᏤᎵ ᎠᎴ ᎤᏂᏁᏉᏨᎯ.

source: Take away, then, his talent and give it to him who has the ten talents.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏥᏙᎡᏥᎩᏏᏉ ᏌᏉ ᎢᏯᎦᏴᎵ ᎠᏕᎸ, ᎠᏍᎪᎯᏃ ᎢᏯᎦᏴᎵ ᏧᎯ ᏤᏥᎥᏏ.

source: For to everyone who has will be given, and he will have more: but from him who has not, even what he has will be taken away.
chr: ᎩᎶᏰᏃ ᎤᎮᏍᏗ ᎠᏥᏁᏗ ᎨᏎᏍᏗ, ᎤᏣᏘᏃ ᎤᏍᏆᏂᎪᏕᏍᏗ; ᎩᎶᏍᎩᏂ ᏄᎲᎾ ᎨᏎᏍᏗ ᎠᏥᎩᎡᏗᏉ ᎨᏎᏍᏗ ᎾᏍᎩ ᎾᏍᏉ ᎤᎲᎢ.

source: And put out the servant who is of no profit into the outer dark: there will be weeping and cries of sorrow.
chr: ᎯᎠᏃ ᎪᎱᏍᏗ ᎬᏙᏗ ᏂᎨᏒᎾ ᎦᏅᏏᏓᏍᏗ ᏙᏱᏗᏢ ᏧᎵᏏᎬ ᏪᏣᏓᎤᎦ; ᎾᎿ ᏓᏂᏴᎨᏍᏗ ᎠᎴ ᏓᏂᎸᏓᎩᏍᎨᏍᏗ ᏓᏂᏄᏙᎬᎢ.

source: But when the Son of man comes in his glory, and all the angels with him, then will he be seated in his glory:
chr: ᎢᏳᏃ ᎿᏉ ᏴᏫ ᎤᏪᏥ ᎦᎷᏨᎭ ᎤᏩᏒ ᎤᏤᎵᎦ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏄᏬᏍᏕᏍᏗ, ᎠᎴ ᏂᎦᏛ ᎨᏥᎸᏉᏗ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏓᏘᏁᎮᏍᏗ, ᎿᏉ ᏓᎦᏂ ᎦᎸᏉᏗᏳ ᎤᏪᏍᎩᎸᎢ;

source: And before him all the nations will come together; and they will be parted one from another, as the sheep are parted from the goats by the keeper.
chr: ᎢᎬᏱᏗᏢᏃ ᏙᏓᎨᏥᎳᏫᏗ ᏂᎦᏗᏳ ᏄᎾᏓᎴᏒ ᏴᏫ, ᎠᎴ ᏙᏛᎦᎴᏅᏔᏂ ᎾᏍᎩᏯ ᎠᏫ-ᏗᎦᏘᏯ ᏥᏓᎦᎴᏅᏗᏍᎪ ᏧᏤᎵ ᎠᏫ ᎤᏂᏃᏕᎾ ᎠᎴ ᎠᏫ ᏗᏂᎭᏄᎸᎯ.

source: And he will put the sheep on his right, but the goats on the left.
chr: ᎠᏫᏃ ᎤᏂᏃᏕᎾ ᎠᎦᏘᏏ ᎢᏗᏢ ᏙᏓᎦᎪᏔᏂ, ᎠᏫᏃ ᏗᏂᎭᏄᎸᎯ ᎠᎦᏍᎦᏂ ᎢᏗᏢ;

source: Then will the King say to those on his right, Come, you who have the blessing of my Father, into the kingdom made ready for you before the world was:
chr: ᎿᏉᏃ ᎤᎬᏫᏳᎯ ᎯᎠ ᏂᏙᏓᎦᏪᏎᎵ ᎠᎦᏘᏏ ᎢᏗᏢ ᎠᏂᏙᎾᎢ; ᎡᏤᎾ, ᎡᏙᏓ ᎢᏥᎸᏉᏔᏅᎯ, ᎢᏣᏤᎵ ᏫᏂᎦᎵᏍᏓ ᎤᏤᎵᎪᎯ ᎡᏣᎵᏍᎪᎸᏓᏁᎸᎯ ᎡᎶᎯ ᏧᏙᏢᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ.

source: For I was in need of food, and you gave it to me: I was in need of drink, and you gave it to me: I was wandering, and you took me in;
chr: ᎠᎪᏄᏰᏃ ᎠᎩᏲᏏᏍᎬᎩ, ᎥᏍᎩᏰᎳᏍᏔᏅᏃ; ᎠᎩᏔᏕᎩᏍᎬᎩ, ᎥᏍᎩᎤᏅᏃ; ᏅᎩᎦᏔᎲᎾ ᎨᏒᎩ, ᎥᏍᎩᏴᏔᏅᎩ;

source: I had no clothing, and you gave it to me: when I was ill, or in prison, you came to me.
chr: ᎠᎩᏰᎸᎭ ᎨᏒᎩ, ᏙᏍᎩᏄᏬᎥᎩᏃ; ᎠᎩᏢᎬᎩ, ᎥᏍᎩᏯᎦᏔᏂᎸᎩᏃ; ᏗᏓᏍᏚᏗᏱ ᎥᎩᏍᏚᎲᎩ, ᎥᏍᎩᏩᏛᎯᎸᎩᏃ.

source: Then will the upright make answer to him, saying, Lord, when did we see you in need of food, and give it to you? or in need of drink, and give it to you?
chr: ᎿᏉᏃ ᎤᎾᏓᏅᏘ ᏛᏂᏁᏥ ᎯᎠ ᏅᏓᎬᏩᏪᏎᎵ; ᏣᎬᏫᏳᎯ, ᎢᎳᎩᏳ ᎢᏨᎪᏒ ᏣᏲᏏᏍᎨᎢ, ᎢᏨᏰᎳᏍᏔᏁᏃ; ᎠᎴ ᏣᏔᏕᎩᏍᎨᎢ, ᎢᏨᎤᏁᏃ;

source: And when did we see you wandering, and take you in? or without clothing, and give it to you?
chr: ᎢᎳᎩᏳ ᎢᏨᎪᎡ ᏁᏣᎦᏔᎲᎾ, ᎢᏨᏴᏔᏁᏃ; ᎠᎴ ᏣᏰᎸᎭ ᎨᏎᎢ, ᎢᏨᏄᏬᎡᏃ;

source: And when did we see you ill, or in prison, and come to you?
chr: ᎠᎴ ᎢᎳᎩᏳ ᎢᏨᎪᎡ ᏣᏢᎨᎢ, ᎠᎴ ᏗᏓᏍᏚᏗᏱ ᎡᏣᏍᏚᎮᎢ, ᎢᏨᏯᎦᏔᏂᎴᏃ?

source: And the King will make answer and say to them, Truly I say to you, Because you did it to the least of these my brothers, you did it to me.
chr: ᎤᎬᏫᏳᎯᏃ ᏓᎧᏁᏥ ᎯᎠ ᏂᏙᏓᎦᏪᏎᎵ; ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎾᏍᎩᏰᏃ ᏥᏁᏣᏛᏁᎸ ᎤᏍᏗᎧᏂ ᎯᎠ ᎾᏍᎩ ᎣᏣᎵᏅᏟ, ᎠᏴ ᏂᏍᎩᏯᏛᏁᎸᎩ.

source: Then will he say to those on the left, Go from me, you cursed ones, into the eternal fire which is ready for the Evil One and his angels:
chr: ᎯᎠᏃ ᎾᏍᏉ ᏂᏙᏓᎦᏪᏎᎵ ᎠᎦᏍᎦᏂ ᎢᏗᏢ ᎠᏂᏙᎾᎢ; ᏍᎩᏯᏓᏅᏏ, ᎡᏥᏍᎦᏨᎯ, ᏫᎾᏍᏛᎾ ᎠᏥᎸᏱ ᏗᎨᏒ ᏫᏥᎶᎯ, ᎾᏍᎩ ᎠᏍᎩᎾ ᎠᎴ ᏧᏤᎵ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎨᎪᏢᎾᏁᎸᎯ.

source: For I was in need of food, and you gave it not to me; I was in need of drink, and you gave it not to me:
chr: ᎠᎪᏄᏰᏃ ᎠᎩᏲᏏᏍᎬᎩ, ᎥᏝᏃ ᏱᏍᎩᏰᎳᏍᏔᏁᎢ; ᎠᎩᏔᏕᎩᏍᎬᎩ, ᎥᏝᏃ ᏱᏍᎩᎤᏁᎢ;

source: I was wandering, and you took me not in; without clothing, and you gave me no clothing; ill, and in prison, and you came not to me.
chr: ᏅᎩᎦᏔᎲᎾ ᎨᏒᎩ, ᎥᏝᏃ ᏱᏍᎩᏴᏔᏁᎢ; ᎠᎩᏰᎸᎭ ᎨᏒᎩ, ᎥᏝᏃ ᏱᏗᏍᎩᏄᏬᎡᎢ; ᎠᎩᏢᎬᎩ, ᎠᎴ ᏗᏓᏍᏚᏗᏱ ᎥᎩᏍᏚᎲᎩ, ᎥᏝᏃ ᏱᏍᎩᏩᏛᎯᎴᎢ.

source: Then will they make answer, saying, Lord, when did we see you in need of food or drink, or wandering, or without clothing, or ill, or in prison, and did not take care of you?
chr: ᎾᏍᏉᏃ ᎾᏍᎩ ᏛᏂᏁᏥ, ᎯᎠ ᏅᏓᎬᏩᏪᏎᎵ, ᏣᎬᏫᏳᎯ, ᎢᎳᎩᏳ ᎢᏨᎪᎡ ᏣᏲᏏᏍᎨᎢ, ᎠᎴ ᏣᏔᏕᎩᏍᎨᎢ, ᎠᎴ ᏁᏣᎦᏔᎲᎾ ᎨᏎᎢ, ᎠᎴ ᏣᏰᎸᎭ ᎨᏎᎢ, ᎠᎴ ᏣᏢᎨᎢ, ᎠᎴ ᏗᏓᏍᏚᏗᏱ ᎡᏣᏍᏚᎮᎢ, ᏂᏨᏍᏕᎸᎲᎾᏃ ᎨᏎᎢ?

source: Then will he make answer to them, saying, Truly I say to you, Because you did it not to the least of these, you did it not to me.
chr: ᎿᏉᏃ ᏓᎧᏁᏥ ᎯᎠ ᏂᏙᏓᎦᏪᏎᎵ; ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎾᏍᎩᏰᏃ ᏁᏣᏛᏁᎸᎾ ᎨᏒ ᎤᏍᏗᎧᏂ ᎯᎠ ᎾᏍᎩ, ᎠᏴ ᎥᏝ ᏱᏂᏍᎩᏯᏛᏁᎴᎢ.

source: And these will go away into eternal punishment; but the upright into eternal life.
chr: ᎯᎠᏃ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎠᎩᎵᏲᎢᏍᏗᏱ ᏗᎨᏒ ᏮᏛᏂᎶᏏ; ᎤᎾᏓᏅᏘᏍᎩᏂ ᏫᎾᏍᏛᎾ ᎬᏂᏛ ᏗᎨᏒᎢ.

source: Chapter 26
chr: ᎠᏯᏙᎸᎢ 26

source: And when Jesus had come to the end of all these words, he said to his disciples,
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏅᎩ, ᎾᏍᎩ ᏥᏌ ᎤᏍᏆᏛ ᏂᎦᏛ ᎯᎠ ᎾᏍᎩ ᏂᎦᏪᏍᎬᎢ, ᎯᎠ ᏂᏚᏪᏎᎸᎩ ᎬᏩᏍᏓᏩᏗᏙᎯ;

source: After two days is the Passover, and the Son of man will be given up to the death of the cross.
chr: ᎢᏥᎦᏔᎭ ᏔᎵ ᎢᏳᏒᎯ ᎧᏃᎯᏰᎩ ᏗᎵᏍᏓᏴᏗᏱ ᎨᏒᎢ, ᎠᎴ ᏴᏫ ᎤᏪᏥ ᏣᎦᏡᏔᏂᏒ ᎠᎦᏛᏗᏱ.

source: Then the chief priests and the rulers of the people came together in the house of the high priest, who was named Caiaphas.
chr: ᎿᏉᏃ ᏚᏂᎳᏫᏤ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᎠᎴ ᏗᏂᎳᏫᎩ ᎠᏁᎲ ᏴᏫ, ᎦᏁᎸ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎧᏯᏆ ᏧᏙᎢᏛ;

source: And they made designs together to take Jesus by some trick, and put him to death.
chr: ᎤᏂᏃᎮᎴᏃ ᎦᎶᏄᎮᏛ ᎤᏅᏙᏗᏱ ᎤᏂᏂᏴᏗᏱ ᏥᏌ, ᎠᎴ ᎤᏂᎯᏍᏗᏱ.

source: But they said, Not while the feast is going on, for fear of trouble among the people.
chr: ᎠᏎᏃ ᎯᎠ ᏄᏂᏪᏎᎢ; ᏞᏍᏗ ᏗᎵᏍᏓᏴᏗᏱ ᎨᏒᎢ, ᎾᎯᏳᏰᏃ ᏱᎩ ᎤᏣᏘ ᏯᎾᎵᏖᎸᎲᎦ ᏴᏫ.

source: Now when Jesus was in Bethany in the house of Simon the leper,
chr: ᏥᏌᏃ ᏇᏗᏂᏱ ᎡᏙᎲᎢ, ᏌᏩᏂ ᎠᏓᏰᏍᎩ ᎤᏢᎩ ᎦᏁᎸᎢ,

source: There came to him a woman having a bottle of perfume of great price, and she put the perfume on his head when he was seated at table.
chr: ᎤᎷᏤᎸᎩ ᎠᎨᏴ ᎠᏰᎲᎩ ᎫᎫ ᏅᏯ ᎤᏁᎬ ᎪᏢᏔᏅᎯ ᎠᏟᏍᏛᎩ ᎤᏣᏘ ᏧᎬᏩᎶᏗ ᎠᏠᏁᏗ, ᎠᎴ ᎤᎶᏁᏔᏅᎩ ᎠᏍᎪᎵ ᎦᏅᎬ ᎠᎵᏍᏓᏴᎲᏍᎬᎢ.

source: But when the disciples saw it they were angry, saying, To what purpose is this waste?
chr: ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎬᏩᎪᎲ ᎤᏂᏔᎳᏬᏒᎩ, ᎯᎠ ᏄᏂᏪᏒᎩ; ᎦᏙᏃ ᎯᎠ ᏣᏤᏬᎩ?

source: For we might have got much money for this and given it to the poor.
chr: ᎯᎠᏰᏃ ᎠᏠᏁᏗ ᏳᎾᏗᏅᏎ ᎤᏣᏘ ᏱᏚᎬᏩᎳᏁᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏲ ᎢᏳᎾᏛᎿᏕᎩ ᏗᏁᏗ ᏱᎨᏎᎢ.

source: But Jesus, seeing it, said to them, Why are you troubling the woman? she has done a kind act to me.
chr: ᏥᏌᏃ ᎤᏙᎴᎰᏒ, ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᎦᏙᏃ ᎢᎡᏣᏕᏯᏙᏗ ᎠᎨᏴ? ᎣᏏᏳᏰᏃ ᏚᎸᏫᏍᏓᏏ ᏥᎾᏋᎦ.

source: For the poor you have ever with you, but me you have not for ever.
chr: ᎤᏲᏰᏃ ᎢᏳᎾᏛᎿᏕᎩ ᏂᎪᎯᎸ ᎨᏤᎳᏗᏙᎭ, ᎠᏴᏍᎩᏂ ᎥᏝ ᏂᎪᎯᎸ ᏱᏨᏰᎳᏗᏙᎭ.

source: For in putting this perfume on my body, she did it to make me ready for my last resting-place.
chr: ᎯᎠᏰᏃ ᎠᏠᏁᏗ ᏥᏰᎸᎢ ᏣᎩᎶᏁᏓ, ᎥᎩᏂᏐᏗᏱ ᎠᏆᏛᏅᎢᏍᏗᎭ.
